simulation/airfoil_base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;


vertices
(
    ( -1000 -100 -1000)
    (  3200 -100 -1000)
    (  3200  100 -1000)
    ( -1000  100 -1000)
    ( -1000 -100  1000)
    (  3200 -100  1000)
    (  3200  100  1000)
    ( -1000  100  1000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (210 10 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (4 5 6 7)
            (3 7 6 2)
            (3 2 1 0)
        );
    }
);


// ************************************************************************* //
