simulation/airfoil_base/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;


geometry 
{
    airfoil.stl
    {
        type distributedTriSurfaceMesh;
        name airfoil;
    }

    refinement1 {
        type searchableBox;
        min ( -0.200 -0.025 -0.200);
        max ( 0.400 0.025 0.200);
    }
};


castellatedMeshControls
{
    maxLocalCells 5000000;
    maxGlobalCells 500000000;
    minRefinementCells 0;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 3;
    
    features
    (
        {
            file "airfoil.eMesh";
            level 0;
        }
    );

    refinementSurfaces
    {
        airfoil
        {
            level (7 7);
            patchInfo { type wall; }
        }
    }
    
    resolveFeatureAngle 30;

    
    refinementRegions
    {
        refinement1
        {
            mode inside;
            levels ((1.0 4));
        }
    }

    limitRegions
    {
    }


    locationInMesh (-0.5 0 0);
    allowFreeStandingZoneFaces true;
}


snapControls
{
    nSmoothPatch 4;
    tolerance 2.0; // 2.0
    nSolveIter 50; // 100
    nRelaxIter 5; // 20
    nFeatureSnapIter 10; // 100
    
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;

    strictRegionSnap true;
}


addLayersControls
{
    relativeSizes true;

    expansionRatio 1.07;
    finalLayerThickness 0.8;
    minThickness 0.001;

    layers
    {
        airfoil
        {
            nSurfaceLayers 25;
        }
    }
    nGrow -1;

    featureAngle 130;
    maxFaceThicknessRatio 0.5;
    nSmoothSurfaceNormals 1;
    nSmoothThickness 10;
    
    minMedialAxisAngle 90;
    maxThicknessToMedialRatio 0.3;
    nSmoothNormals 3;
    slipFeatureAngle 10;
    nRelaxIter 5;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 0;
}


meshQualityControls
{
    #include "meshQualityDict"

    minDeterminant 1e-8;

    relaxed
    {
        maxNonOrtho 75;
        minTetQuality -1e30;
        minTwist    -1;
    }

    nSmoothScale 4;
    errorReduction 0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //
